In [1]:
import pandas as pd
import numpy as np
import yfinance as yf
import matplotlib.pyplot as plt

C:\Users\thinkpad\anaconda3\envs\r-tutorial\lib\site-packages\yfinance\base.py:48: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  _empty_series = pd.Series()

# Check the WRDS balance sheet data

In [2]:
balance_sheet = pd.read_csv('balance sheet.csv')

In [3]:
balance_sheet.head()

,gvkey,fqtr,fyearq,datadate,actq,ancq,atq,lltq,ltq,isin,conm,gind,loc
0,18075,4,2010,2010/12/31,197.081,1026.874,1223.955,707.319,1044.091,BRAZULACNPR4,AZUL SA,203020.0,BRA
1,18075,4,2011,2011/12/31,495.416,1468.587,1964.003,1322.385,1905.621,BRAZULACNPR4,AZUL SA,203020.0,BRA
2,18075,1,2012,2012/3/31,NaN,NaN,NaN,NaN,NaN,BRAZULACNPR4,AZUL SA,203020.0,BRA
3,18075,4,2012,2012/12/31,1011.983,3739.802,4751.785,2431.790,4400.754,BRAZULACNPR4,AZUL SA,203020.0,BRA
4,18075,1,2013,2013/3/31,926.338,3880.680,4807.018,2514.487,4423.179,BRAZULACNPR4,AZUL SA,203020.0,BRA

## Drop the companies that do not have stock data available

In [4]:
balance_sheet = balance_sheet[balance_sheet['isin'].isin(['CL0002694637', 'CL0000000035', 'MXP000511016', 'BRABEVACNOR1', 'MX01AM050019', 'BRAMERACNOR6', 'MX01AX040009', 'BRABCBACNPR4', 'BRBBDCACNPR8', 'BRBPACUNT006', 'COB51PA00076', 'COB01PA00030', 'CLP0939W1081', 'CLP321331116', 'BRBBASACNOR3', 'BRBRSRACNPB4', 'BRBNBRACNOR8', 'CL0002209568', 'CL0002841873', 'PAP169941328', 'BRBPANACNPR1', 'ARMERI013163', 'BRSANBACNPR5', 'CLP1506A1070', 'BRBRKMACNPA4', 'BRBSLIACNPR2', 'BRBRFSACNOR8', 'CLP256251073', 'ARP2006N1025', 'MXP225611567', 'BRELETACNPB7', 'CLP3615W1037', 'BRCEEBACNOR3', 'BRSBSPACNOR5', 'BRCMIGACNPR3', 'BRCSRNACNOR0', 'BRCSNAACNOR6', 'CLP249051044', 'BRCSANACNOR6', 'BMG2519Y1084', 'MXP339881098', 'COC04PA00016', 'MXP369181377', 'CLP3697S1034', 'BREMBRACNOR4', 'ARENOR010020', 'CLP371151059', 'CL0000001314', 'CLP7847L1080', 'CLP371861061', 'CLP3710M1090', 'CL0001583070', 'CL0000006586', 'CLP3880F1085', 'MXP320321310', 'GB00B2QPKJ12', 'MX01GC2M0006', 'BMG383271050', 'BRGGBRACNPR8', 'BRGOLLACNPR4', 'MXP4948K1056', 'MXP495211262', 'COT13PA00086', 'MX01GI020004', 'MX01KU000012', 'MXP370841019', 'MXP791641105', 'MXP4987V1378', 'BRHYPEACNOR0', 'MX01ID000009', 'MXP554091415', 'BRMYPKACNOR7', 'BRJBSSACNOR8', 'MXP606941179', 'BRKLBNACNPR9', 'CL0000000423', 'BRRENTACNOR4', 'BRMRFGACNOR0', 'CLP969051075', 'BRBEEFACNOR6', 'CLP6877L1036', 'BRMRSAACNOR6', 'BRNTCOACNOR5', 'MX01NE000001', 'BRNEOEACNOR3', 'BROIBRACNPR8', 'MX01OR010004', 'ARP432631215', 'BRPETRACNPR6', 'BRRAILACNOR9', 'BRSMTOACNOR3', 'CL0002455229', 'BRSUZBACNOR0', 'ARP9028N1016', 'ARP9308R1039', 'BRTUPYACNOR1', 'BRUGPAACNOR8', 'BRUSIMACNPA6', 'BRVALEACNOR0', 'ARP9897X1319'])]

In [5]:
isin_with_2006 = list(balance_sheet[balance_sheet['fyearq']==2006]['isin'].unique())

In [6]:
len(isin_with_2006)

100

In [7]:
balance_sheet_2006 = balance_sheet[balance_sheet['isin'].isin(isin_with_2006)].reset_index(drop = True)

In [8]:
balance_sheet_2006.head()

,gvkey,fqtr,fyearq,datadate,actq,ancq,atq,lltq,ltq,isin,conm,gind,loc
0,25751,1,2006,2006/3/31,NaN,NaN,3105.000,NaN,2518.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
1,25751,2,2006,2006/6/30,NaN,NaN,3532.000,NaN,2974.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
2,25751,3,2006,2006/9/30,NaN,NaN,3521.000,NaN,2956.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
3,25751,4,2006,2006/12/31,NaN,NaN,3978.337,NaN,3394.442,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
4,25751,1,2007,2007/3/31,NaN,NaN,4274.000,NaN,3684.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN

# Deal with missing values in `balance_sheet_2006`

In [9]:
balance_sheet_2006['isin'].nunique()

100

In [10]:
balance_sheet_2006.shape

(7057, 13)

In [11]:
np.sum(balance_sheet_2006.isnull(), axis = 0)

gvkey          0
fqtr           0
fyearq         0
datadate       0
actq        1570
ancq        1570
atq           79
lltq        1571
ltq           79
isin           0
conm           0
gind           0
loc            0
dtype: int64

In [12]:
# remove actq, ancq, lltq, as there are too many missing values
balance_sheet_2006.drop(columns = ['actq', 'ancq', 'lltq'], inplace = True)

In [13]:
balance_sheet_2006.columns

Index(['gvkey', 'fqtr', 'fyearq', 'datadate', 'atq', 'ltq', 'isin', 'conm',
       'gind', 'loc'],
      dtype='object')

In [14]:
balance_sheet_2006.columns = ['key', 'fiscal_quarter', 'fiscal_year', 'datadate', 'total_assets', 'total_liabilities', 'isin', 'company_name', 'gic_industries', 'iso_country_code']

In [15]:
balance_sheet_2006.tail()

,key,fiscal_quarter,fiscal_year,datadate,total_assets,total_liabilities,isin,company_name,gic_industries,iso_country_code
7052,320759,3,2022,2022/9/30,4652883.0,4392316.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL
7053,320759,4,2022,2022/12/31,4375726.0,4105241.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL
7054,320759,1,2023,2023/3/31,4360215.0,4080433.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL
7055,320759,2,2023,2023/6/30,4582879.0,4291507.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL
7056,320759,3,2023,2023/9/30,4914894.0,4576074.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL

## Check the starting date of each company

In [16]:
balance_sheet_2006['datadate'] = pd.to_datetime(balance_sheet_2006['datadate'])
balance_sheet_2006['MM-DD'] = balance_sheet_2006['datadate'].dt.strftime('%m-%d')

In [17]:
balance_sheet_2006['MM-DD'].value_counts()

03-31    1761
06-30    1756
09-30    1750
12-31    1698
01-31      24
04-30      22
07-31      22
10-31      22
08-31       2
Name: MM-DD, dtype: int64

In [18]:
balance_sheet_2006[balance_sheet_2006['MM-DD'].isin(['01-31', '04-30', '07-31', '10-31', '08-31'])]['isin'].unique()

array(['ARP2006N1025', 'CL0002841873', 'BRCSANACNOR6', 'BRSMTOACNOR3'],
      dtype=object)

In [19]:
# Count the number of unsuitable dates
for isin in ['ARP2006N1025', 'CL0002841873', 'BRCSANACNOR6', 'BRSMTOACNOR3']:
    temp = balance_sheet_2006[balance_sheet_2006['isin']==isin]
    count = sum(temp['MM-DD'].isin(['01-31', '04-30', '07-31', '10-31', '08-31']))
    print(isin, 'total:', temp.shape[0], 'unsuitable dates:', count)

ARP2006N1025 total: 72 unsuitable dates: 72
CL0002841873 total: 73 unsuitable dates: 2
BRCSANACNOR6 total: 72 unsuitable dates: 13
BRSMTOACNOR3 total: 75 unsuitable dates: 5

### Decision:
Drop ARP2006N1025, and the unsuitable rows for other isin.

In [20]:
balance_sheet_2006 = balance_sheet_2006[~(balance_sheet_2006['MM-DD'].isin(['01-31', '04-30', '07-31', '10-31', '08-31']))]
balance_sheet_2006.shape

(6965, 11)

In [21]:
balance_sheet_2006.tail()

,key,fiscal_quarter,fiscal_year,datadate,total_assets,total_liabilities,isin,company_name,gic_industries,iso_country_code,MM-DD
7052,320759,3,2022,2022-09-30,4652883.0,4392316.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL,09-30
7053,320759,4,2022,2022-12-31,4375726.0,4105241.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL,12-31
7054,320759,1,2023,2023-03-31,4360215.0,4080433.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL,03-31
7055,320759,2,2023,2023-06-30,4582879.0,4291507.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL,06-30
7056,320759,3,2023,2023-09-30,4914894.0,4576074.0,CL0002209568,BANCO INTERNACIONAL SA,401010.0,CHL,09-30

In [22]:
# find the number of companies available in balance_sheet_2006
balance_sheet_2006['isin'].nunique()

99

In [23]:
quarterly_dates = pd.date_range(start='2006-01-01', end='2023-12-31', freq='Q').to_list()
correct_datetime = pd.DataFrame({'datadate': quarterly_dates})
correct_datetime.head()

    datadate
0 2006-03-31
1 2006-06-30
2 2006-09-30
3 2006-12-31
4 2007-03-31

In [24]:
# find the expected length of the dataframe
len(quarterly_dates*(balance_sheet_2006['isin'].nunique()))

7128

In [25]:
correct_datetime.set_index('datadate', inplace = True)

In [26]:
company_list = list(balance_sheet_2006['isin'].unique())

In [27]:
first_company_info = balance_sheet_2006[balance_sheet_2006['isin'] == company_list[0]].set_index('datadate')
balance_sheet_adjusted = first_company_info.join(correct_datetime, how = 'outer').reset_index()

for column in ['key', 'isin', 'company_name', 'gic_industries', 'iso_country_code']:
    balance_sheet_adjusted[column] = balance_sheet_adjusted[balance_sheet_adjusted[column].notnull()][column].unique().item()
    
balance_sheet_adjusted['fiscal_quarter']=balance_sheet_adjusted['datadate'].dt.quarter
balance_sheet_adjusted['fiscal_year']=balance_sheet_adjusted['datadate'].dt.year

In [28]:
for isin in company_list[1:]:
    temp = balance_sheet_2006[balance_sheet_2006['isin'] == isin].set_index('datadate')
    temp = temp.join(correct_datetime, how = 'outer').reset_index()
    for column in ['key', 'isin', 'company_name', 'gic_industries', 'iso_country_code']:
        temp[column] = temp[temp[column].notnull()][column].unique().item()
    temp['fiscal_quarter']=temp['datadate'].dt.quarter
    temp['fiscal_year']=temp['datadate'].dt.year
    balance_sheet_adjusted = pd.concat([balance_sheet_adjusted, temp], axis = 0)

In [29]:
# Check that the number of rows is correct
balance_sheet_adjusted.reset_index(inplace = True, drop = True)
balance_sheet_adjusted.drop(columns = ['MM-DD'], inplace = True)
balance_sheet_adjusted.shape[0]

7128

In [30]:
balance_sheet_adjusted.head()

,datadate,key,fiscal_quarter,fiscal_year,total_assets,total_liabilities,isin,company_name,gic_industries,iso_country_code
0,2006-03-31,25751.0,1,2006,3105.000,2518.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
1,2006-06-30,25751.0,2,2006,3532.000,2974.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
2,2006-09-30,25751.0,3,2006,3521.000,2956.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
3,2006-12-31,25751.0,4,2006,3978.337,3394.442,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
4,2007-03-31,25751.0,1,2007,4274.000,3684.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN

In [31]:
np.sum(balance_sheet_adjusted.isnull(), axis = 0)

datadate               0
key                    0
fiscal_quarter         0
fiscal_year            0
total_assets         239
total_liabilities    239
isin                   0
company_name           0
gic_industries         0
iso_country_code       0
dtype: int64

In [32]:
null_rows = balance_sheet_adjusted[balance_sheet_adjusted['total_assets'].isnull()]
null_rows[['datadate','total_assets', 'total_liabilities']].groupby(['datadate']).size().sort_values(ascending = False)

datadate
2023-12-31    81
2006-03-31    18
2006-06-30    16
2006-09-30    13
2023-09-30    13
2008-03-31    10
2007-03-31     9
2007-06-30     8
2007-09-30     7
2008-06-30     7
2008-09-30     7
2009-03-31     5
2010-06-30     4
2010-09-30     4
2009-09-30     4
2006-12-31     3
2010-03-31     3
2009-06-30     3
2011-09-30     3
2012-03-31     2
2011-06-30     2
2011-03-31     2
2008-12-31     1
2012-06-30     1
2012-09-30     1
2013-03-31     1
2013-06-30     1
2014-03-31     1
2014-06-30     1
2017-06-30     1
2018-09-30     1
2020-03-31     1
2020-09-30     1
2021-09-30     1
2023-03-31     1
2023-06-30     1
2007-12-31     1
dtype: int64

In [33]:
null_rows[['isin','total_assets', 'total_liabilities']].groupby(['isin']).size().sort_values(ascending = False)

isin
COT13PA00086    16
CL0002209568    15
BRCSANACNOR6    13
MX01GI020004    12
CL0000006586    10
                ..
CL0002694637     1
CL0002841873     1
CLP249051044     1
CLP256251073     1
PAP169941328     1
Length: 87, dtype: int64

# After noticing that there are only 69 available:

In [34]:
isin_list = ['CL0002694637', 'CL0000000035', 'MXP000511016', 'BRABEVACNOR1', 'MX01AM050019', 'BRAMERACNOR6', 'MX01AX040009', 'COB01PA00030', 'BRBBASACNOR3', 'BRBNBRACNOR8', 'PAP169941328', 'BRSANBACNPR5', 'CLP1506A1070', 'BRBRKMACNPA4', 'BRBRFSACNOR8', 'CLP256251073', 'MXP225611567', 'CLP3615W1037', 'BRCEEBACNOR3', 'BRSBSPACNOR5', 'BRCMIGACNPR3', 'BRCSRNACNOR0', 'BRCSNAACNOR6', 'CLP249051044', 'BRCSANACNOR6', 'BMG2519Y1084', 'MXP339881098', 'MXP369181377', 'CLP3697S1034', 'BREMBRACNOR4', 'CLP371151059', 'CL0000001314', 'CLP7847L1080', 'CLP371861061', 'CLP3710M1090', 'CL0001583070', 'CLP3880F1085', 'MXP320321310', 'MX01GC2M0006', 'BRGGBRACNPR8', 'BRGOLLACNPR4', 'MXP4948K1056', 'MXP495211262', 'COT13PA00086', 'MX01KU000012', 'MXP370841019', 'MXP791641105', 'MXP4987V1378', 'MX01ID000009', 'MXP554091415', 'BRMYPKACNOR7', 'MXP606941179', 'CL0000000423', 'BRRENTACNOR4', 'CLP969051075', 'CLP6877L1036', 'BROIBRACNPR8', 'MX01OR010004', 'ARP432631215', 'BRPETRACNPR6', 'CL0002455229', 'BRSUZBACNOR0', 'ARP9028N1016', 'ARP9308R1039', 'BRTUPYACNOR1', 'BRUGPAACNOR8', 'BRUSIMACNPA6', 'BRVALEACNOR0', 'ARP9897X1319']

In [35]:
balance_sheet_adjusted = balance_sheet_adjusted[balance_sheet_adjusted['isin'].isin(isin_list)]

In [36]:
balance_sheet_adjusted.shape

(4968, 10)

In [37]:
np.sum(balance_sheet_adjusted.isnull(), axis = 0)

datadate               0
key                    0
fiscal_quarter         0
fiscal_year            0
total_assets         119
total_liabilities    119
isin                   0
company_name           0
gic_industries         0
iso_country_code       0
dtype: int64

# Linear interpolation

In [38]:
interpolated_balance_sheet = balance_sheet_adjusted

In [39]:
interpolated_balance_sheet['total_assets'] = balance_sheet_adjusted['total_assets'].interpolate(method='linear')
interpolated_balance_sheet['total_liabilities'] = balance_sheet_adjusted['total_liabilities'].interpolate(method='linear')

In [40]:
interpolated_balance_sheet.head()

,datadate,key,fiscal_quarter,fiscal_year,total_assets,total_liabilities,isin,company_name,gic_industries,iso_country_code
0,2006-03-31,25751.0,1,2006,3105.000,2518.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
1,2006-06-30,25751.0,2,2006,3532.000,2974.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
2,2006-09-30,25751.0,3,2006,3521.000,2956.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
3,2006-12-31,25751.0,4,2006,3978.337,3394.442,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN
4,2007-03-31,25751.0,1,2007,4274.000,3684.000,PAP169941328,BANCO LATINOAMERICANO DE COM,402010.0,PAN

In [42]:
np.sum(interpolated_balance_sheet.isnull(), axis = 0)

datadate             0
key                  0
fiscal_quarter       0
fiscal_year          0
total_assets         0
total_liabilities    0
isin                 0
company_name         0
gic_industries       0
iso_country_code     0
dtype: int64

# Export the interpolated balance sheet

In [43]:
#interpolated_balance_sheet.to_csv('interpolated balance sheet.csv', index=False)